# ======== Задание 1 ==========
print("Задание 1 ========".upper())

name = input("Ваше имя: ")
surname = input("Ваша фамилия: ")
age = int(input("Ваш возраст: "))
year_birth = int(input("Год рождения: "))
man_info = f'{surname} {name}, возраст {age} лет, {year_birth} года рождения'
print(man_info)

print("---------------------")
# =============================

# ======== Задание 2 ==========
print("Задание 2 ========".upper())

all_sec = int(input("Введите количество секунд: "))
hour = all_sec // 3600
print(hour)
min = (all_sec // 60) % 60
print(min)
sec = all_sec % 60
print(sec)
print(f'{hour:02}:{min:02}:{sec:02}')

print("---------------------")
# =============================

# ======== Задание 3 ==========
print("Задание 3 ========".upper())

n = input('Введите число "n": ')
n2 = n + n
n3 = n + n + n
result = int(n) + int(n2) + int(n3)
print(f'{n} + {n2} + {n3} = {result}')

print("---------------------")
# =============================

# ======== Задание 4 ==========
print("Задание 4 ========".upper())

number = list(input("Введите число: "))
max_numb = max(number)
print("Максимальное число из введенного:", max_numb)

print("---------------------")
# =============================

# ======== Задание 5 ==========
print("Задание 5 ========".upper())

income = int(input("Укажите общую выручку (уе): "))
cost = int(input("Укажите общее число издержек(уе): "))
profit = income - cost
res = (profit / income) * 100
people = int(input("Укажите численность сотрудников: "))
if income > cost:
    print(f"Вы молодец! Ваша выручка превышает издержки. Прибыль составляет {profit} уе.")
    print(f"Рентабельность составила: {res} %")
    print(f"Прибыль в расчете на одного сотрудника составляет: {profit / people} уе.")
else:
    print("Что-то где-то пошло не так! Работаете в минус!!!".upper())
    print(f"Рентабельность составила: {res} %")
    print(f"Убыток в расчете на одного сотрудника составляет: {profit / people} уе.")

print("---------------------")
# =============================

# ======== Задание 6 ==========
print("Задание 6 ========".upper())

a = 2
b = 3
i = 1
print(f'{i}-й день: {a:.2f} км.')
while a <= b:
    i = i + 1
    a = a + (a * 10) / 100
    print(f'{i}-й день: {a:.2f} км.')
print(f"Ответ: на {i}-й день спортсмен достиг результата - 3 км.")

print("---------------------")
# =============================
