# print("============ Задание 1 ==============".upper())

# first_list = [1, 2, 'abc', 3.14, ['a', 'b', 'c'], (1, 2, 3)]
# for i in first_list:
#     print(type(i))

# print("=====================================")

# print("============ Задание 2 ==============".upper())



# print("=====================================")

# print("============ Задание 3 ==============".upper())
# # !!!! НАПИСАТЬ ЕЩЕ ЧЕРЕЗ СПИСОК
# my_dict = {
#     1: 'зима',
#     2: 'зима',
#     3: 'весна',
#     4: 'весна',
#     5: 'весна',
#     6: 'лето',
#     7: 'лето',
#     8: 'лето',
#     9: 'осень',
#     10: 'осень',
#     11: 'осень',
#     12: 'зима',
# }
# while True:
#     try:
#         numb = int(input('Введите число от 1 до 12: '))
#         break
#     except ValueError:
#         print('Введите число!!!')

# res = my_dict.get(numb)
# print(res)

# print("=====================================")

# print("============ Задание 4 ==============".upper())



# print("=====================================")

# print("============ Задание 5 ==============".upper())



# print("=====================================")

# print("============ Задание 6 ==============".upper())



# print("=====================================")
